app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    authorize @category

    if @category.save
---
INSERT INTO "categories" ("name", "category_id", "details", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "lungi"], ["category_id", 1], ["details", "hghjieksjnxc"], ["created_at", "2023-11-12 08:41:51.830574"], ["updated_at", "2023-11-12 08:41:51.830574"]]

  def update
    find_category

    if @category.update(category_params)
---
UPDATE "categories" SET "category_id" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["category_id", 2], ["updated_at", "2023-11-12 08:40:21.654698"], ["id", 3]]

    def find_category
      @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]