app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name ILIKE '%hi%')
SELECT "products".* FROM "products"
---
  def index
    if params[:search].present?
      @products = Product.where("name ILIKE ?", "%#{params[:search]}%")
    else
    @products = Product.all

INSERT INTO "products" ("name", "description", "price", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "sjsns"], ["description", nil], ["price", "333.0"], ["category_id", 5], ["created_at", "2023-11-12 08:55:15.098342"], ["updated_at", "2023-11-12 08:55:15.098342"]]
---
  def create
    @product = Product.new(product_params)

    if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def find_product
    @product = Product.find(params[:id])