app/controllers/user_roles_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if current_user.super_admin?
    @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def find_user
      @user = User.find(params[:id])