app/controllers/variants_controller.rb

  def create
    find_product
    @variant = @product.variants.create(variant_params)
---
INSERT INTO "variants" ("color", "size", "sku", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["color", "red"], ["size", "small"], ["sku", "medvlv"], ["product_id", 1], ["created_at", "2023-10-30 10:29:01.308366"], ["updated_at", "2023-10-30 10:29:01.308366"]]

      def find_product
        @product = Product.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

      def find_variant
        @variant = Variant.find(params[:id])
---
SELECT "variants".* FROM "variants" WHERE "variants"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]