app/views/categories/edit.html.erb

          <div class="col-sm-10">
          <%= form.select :category_id, Category.where(category_id: nil).map { |c| [c.name, c.id] }, class: "form-control form-select" %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."category_id" IS NULL