app/views/products/edit.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."category_id" <= $1  [["category_id", 10]]
---
            <div class="col-sm-10">
            <%= form.select :category_id, Category.where.not(category_id: nil).map { |c| [c.name, c.id] }, class: "form-control form-select" %>