app/views/products/new.html.erb

            <div class="col-sm-10">
            <%= form.select :category_id, Category.where(category_id: present?).map { |c| [c.name, c.id] }, class: "form-control form-select" %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."category_id" = $1  [["category_id", 1]]