app/views/products/show.html.erb

SELECT "variants".* FROM "variants" WHERE "variants"."product_id" = $1  [["product_id", 5]]
---
<div class="container d-flex flex-row">
  <% @product.variants.each do |variant| %>